app/controllers/products_controller.rb

INSERT INTO `products` (`created_at`, `description`, `image_url`, `price`, `title`, `updated_at`) VALUES ('2014-09-15 02:18:09', '<p>Some description etc </p>', 'cs.jpg', 36.0, 'CoffeeScript', '2014-09-15 02:18:09')
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save